# Progetto di FoCS
## Studente
## Raffaele Moretti : matricola 794537

Importazione delle librerie necessarie

In [1]:
import pandas as pd
import numpy as np
import re

# Esplorazione dei datasets

In [2]:
cwur = pd.read_csv("cwurData.csv")
cwur.head()

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
0,1,Harvard University,USA,1,7,9,1,1,1,1,NaN,5,100.00,2012
1,2,Massachusetts Institute of Technology,USA,2,9,17,3,12,4,4,NaN,1,91.67,2012
2,3,Stanford University,USA,3,17,11,5,4,2,2,NaN,15,89.50,2012
3,4,University of Cambridge,United Kingdom,1,10,24,4,16,16,11,NaN,50,86.17,2012
4,5,California Institute of Technology,USA,4,2,29,7,37,22,22,NaN,18,85.21,2012

In [3]:
educational = pd.read_csv("educational_attainment_supplementary_data.csv")  
educational.head()

,country_name,series_name,1985,1986,1987,1990,1991,1992,1993,1995,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,2015
0,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.33,NaN,NaN,0.44,NaN,NaN,NaN,0.57,...,0.86,NaN,NaN,NaN,NaN,1.27,NaN,NaN,NaN,NaN
1,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1.03,NaN,NaN,1.26,NaN,NaN,NaN,1.54,...,2.18,NaN,NaN,NaN,NaN,2.64,NaN,NaN,NaN,NaN
2,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.83,NaN,NaN,0.95,NaN,NaN,NaN,1.26,...,1.01,NaN,NaN,NaN,NaN,2.45,NaN,NaN,NaN,NaN
3,Afghanistan,"Barro-Lee: Average years of primary schooling,...",2.34,NaN,NaN,2.22,NaN,NaN,NaN,2.37,...,2.26,NaN,NaN,NaN,NaN,3.55,NaN,NaN,NaN,NaN
4,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.54,NaN,NaN,0.92,NaN,NaN,NaN,0.94,...,2.00,NaN,NaN,NaN,NaN,1.29,NaN,NaN,NaN,NaN

In [4]:
educational.shape

(79055, 29)

In [5]:
school = pd.read_csv("school_and_country_table.csv")
school.head()

                             school_name                   country
0                     Harvard University  United States of America
1     California Institute of Technology  United States of America
2  Massachusetts Institute of Technology  United States of America
3                    Stanford University  United States of America
4                   Princeton University  United States of America

In [6]:
shanghai = pd.read_csv("shanghaiData.csv")
shanghai.head()

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year
0,1,Harvard University,1,100.0,100.0,100.0,100.0,100.0,100.0,72.4,2005
1,2,University of Cambridge,1,73.6,99.8,93.4,53.3,56.6,70.9,66.9,2005
2,3,Stanford University,2,73.4,41.1,72.2,88.5,70.9,72.3,65.0,2005
3,4,"University of California, Berkeley",3,72.8,71.8,76.0,69.4,73.9,72.2,52.7,2005
4,5,Massachusetts Institute of Technology (MIT),4,70.1,74.0,80.6,66.7,65.8,64.3,53.0,2005

In [7]:
times = pd.read_csv("timesData.csv")
times.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
0,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,"20,152",8.9,25%,NaN,2011
1,2,California Institute of Technology,United States of America,97.7,54.6,98.0,99.9,83.7,96.0,"2,243",6.9,27%,33 : 67,2011
2,3,Massachusetts Institute of Technology,United States of America,97.8,82.3,91.4,99.9,87.5,95.6,"11,074",9.0,33%,37 : 63,2011
3,4,Stanford University,United States of America,98.3,29.5,98.1,99.2,64.3,94.3,"15,596",7.8,22%,42 : 58,2011
4,5,Princeton University,United States of America,90.9,70.3,95.4,99.9,-,94.2,"7,929",8.4,27%,45 : 55,2011

## Esplorazione del contenuto delle colonne d'interesse

 Elenco in ordine alfabetico i paesi in modo da scorgere più facilmente eventuali errori

In [8]:
a = times["country"].unique()
a = sorted(a, key=str.lower)
print(a[:10])

['Argentina', 'Australia', 'Austria', 'Bangladesh', 'Belarus', 'Belgium', 'Brazil', 'Canada', 'Chile', 'China']

Elenco le università in ordine alfabetico di times

In [9]:
b = times["university_name"].unique()
b = sorted(b, key=str.lower)
print(b[:10])

['Aalborg University', 'Aalto University', 'Aarhus University', 'Aberystwyth University', 'Adam Mickiewicz University', 'AGH University of Science and Technology', 'Aix-Marseille University', 'Ajou University', 'Alexandria University', 'Alexandru Ioan Cuza University']

In [10]:
len(b)

818

In [11]:
times.dtypes

world_rank                 object
university_name            object
country                    object
teaching                  float64
international              object
research                  float64
citations                 float64
income                     object
total_score                object
num_students               object
student_staff_ratio       float64
international_students     object
female_male_ratio          object
year                        int64
dtype: object

In [12]:
times.describe()

          teaching     research    citations  student_staff_ratio         year
count  2603.000000  2603.000000  2603.000000          2544.000000  2603.000000
mean     37.801498    35.910257    60.921629            18.445283  2014.075682
std      17.604218    21.254805    23.073219            11.458698     1.685733
min       9.900000     2.900000     1.200000             0.600000  2011.000000
25%      24.700000    19.600000    45.500000            11.975000  2013.000000
50%      33.900000    30.500000    62.500000            16.100000  2014.000000
75%      46.400000    47.250000    79.050000            21.500000  2016.000000
max      99.700000    99.400000   100.000000           162.600000  2016.000000

In [13]:
c= cwur["country"].unique()
c = sorted(c, key=str.lower)
print(c[:10])

['Argentina', 'Australia', 'Austria', 'Belgium', 'Brazil', 'Bulgaria', 'Canada', 'Chile', 'China', 'Colombia']

In [14]:
c= cwur["institution"].unique()
c = sorted(c, key=str.lower)
print(c[:10])

['Aalborg University', 'Aalto University', 'Aarhus University', 'Aberystwyth University', 'Adam Mickiewicz University in Poznań', 'AGH University of Science and Technology', 'Ain Shams University', 'Aix-Marseille University', 'Ajou University', 'Albany Medical College']

cwur contiene più università degli altri datasets

In [15]:
len(c)

1024

In [16]:
d = school["school_name"].unique()
d = sorted(d, key=str.lower)
print(d[:10])

['Aalborg University', 'Aalto University', 'Aarhus University', 'Aberystwyth University', 'Adam Mickiewicz University', 'AGH University of Science and Technology', 'Aix-Marseille University', 'Ajou University', 'Alexandria University', 'Alexandru Ioan Cuza University']

In [17]:
len(d)

818

Necessario per poter ordinare i valori

In [18]:
shanghai = shanghai[shanghai["university_name"].notnull()]

In [19]:
e = shanghai["university_name"].unique()
e = sorted(e, key=str.lower)
print(e[:10])

['Aalborg University', 'Aalto University', 'Aarhus University', 'Aix Marseille University', 'Aix-Marseille University', 'Aristotle University of Thessaloniki', 'Arizona State University', 'Arizona State University - Tempe', 'Auburn University', 'Autonomous University of Barcelona']

In [20]:
len(e)

658

In [21]:
school.rename(columns={"school_name":"university_name"}, inplace=True)

Verifico se Times e School hanno le stesse università in quanto la lunghezza della unique è la stessa

In [22]:
school_times=pd.merge(times, school , on=["university_name"])

In [23]:
fuso = school_times["university_name"].unique()
fuso = sorted(fuso, key=str.lower)
len(fuso) #la lunghezza è la stessa quindi le università sono le stesse

818

In [24]:
shanghai[["university_name"]].shape

(4896, 1)

In [25]:
times[["university_name"]].shape

(2603, 1)

In [26]:
school[["university_name"]].shape

(818, 1)

In [27]:
cwur[["institution"]].shape

(2200, 1)

In [28]:
educational = educational[educational["country_name"].notnull()]

In [29]:
f = educational["country_name"].unique()
f= sorted(f, key=str.lower)
print(f[:10])

['Afghanistan', 'Albania', 'Algeria', 'Andorra', 'Argentina', 'Armenia', 'Aruba', 'Australia', 'Austria', 'Azerbaijan']

# Preprocessing

 Parte con  times

In [30]:
times["country"]=times["country"].str.replace("Unted Kingdom", "United Kingdom")

In [31]:
times["country"]=times["country"].str.replace("Unisted States of America","United States of America")

In [32]:
times["country"]=times["country"].str.replace("Republic of Ireland", "Ireland")

In [33]:
times["country"]=times["country"].str.replace("Russian Federation", "Russia")

Si controllano le differenze tra i datasets shanghai e times

In [34]:
b = pd.DataFrame(b,columns=["university_name"])
e = pd.DataFrame(e,columns=["university_name"])

In [35]:
e.head()

            university_name
0        Aalborg University
1          Aalto University
2         Aarhus University
3  Aix Marseille University
4  Aix-Marseille University

In [36]:
right = e.merge(b, how = "outer" ,indicator=True).loc[lambda x : x["_merge"]=="right_only"]
right.head()

                              university_name      _merge
658                    Aberystwyth University  right_only
659                Adam Mickiewicz University  right_only
660  AGH University of Science and Technology  right_only
661                           Ajou University  right_only
662                     Alexandria University  right_only

Si considera solo la parte di testo prima delle parentesi tonde per facilitare la pulizia della colonna

In [37]:
times["university_name"]=times["university_name"].apply(lambda x: x.split("(")[0])

Elimino lo spazio finale vicino alla parentesi

In [38]:
times.university_name = times.university_name.str.rstrip()

Vado a modificare manualmente alcune righe di university_name in quanto non è possibile correggerle in altro modo

In [39]:
times["university_name"] =times["university_name"].str.replace("Technion Israel Institute of Technology", "Technion", regex =True)
times["university_name"] =times["university_name"].str.replace("State University of New York Albany", "State University of New York at Albany", regex =True)
times["university_name"] =times["university_name"].str.replace("University of Bari Aldo Moro", "University of Bari", regex =True)
times["university_name"] =times["university_name"].str.replace("University of Nebraska-Lincoln", "University of Nebraska", regex =True)
times["university_name"] =times["university_name"].str.replace("University of Rome II – Tor Vergata", "University of Roma-Tor Vergata", regex =True)
times["university_name"] =times["university_name"].str.replace("University of Tennessee - Knoxville", "University of Tennessee", regex =True)
times["university_name"] =times["university_name"].str.replace("University of Wisconsin - Madison" , "University of Wisconsin", regex =True)
times["university_name"] =times["university_name"].str.replace("Vrije Universiteit Brussel", "Vrije University Brussel", regex =True)
times["university_name"] =times["university_name"].str.replace("Washington University in St Louis", "Washington University in St. Louis", regex =True)
times["university_name"] =times["university_name"].str.replace("École Normale Supérieure de Lyon", "École normale supérieure de Lyon", regex =True)

Si elimina il nome della città o nome del campus dopo quello dell'università

In [40]:
times["university_name"]=times["university_name"].apply(lambda x: x.split(" - ")[0])
times.university_name = times.university_name.str.rstrip()

Si elimina il prefisso 'THE' e anche lo spazio rimanente

In [41]:
times["university_name"] = times["university_name"].str.replace("The","", regex=True)
times.university_name = times.university_name.str.lstrip()

Parte con Shanghai

Si considera solo la parte di testo prima delle parentesi tonde

In [42]:
shanghai["university_name"]=shanghai["university_name"].apply(lambda x: x.split("(")[0])

Si considera solo la parte di testo prima delle parentesi tonde per facilitare la pulizia della colonna

In [43]:
shanghai.university_name = shanghai.university_name.str.rstrip()

Vado a modificare manualmente alcune righe di university_name in quanto non è possibile correggerle in altro modo

In [44]:
shanghai["university_name"] = shanghai["university_name"].str.replace("Aix Marseille University", "Aix-Marseille University", regex =True)
shanghai["university_name"] = shanghai["university_name"].str.replace("Erasmus University Rotterdam", "Erasmus University", regex =True)
shanghai["university_name"] = shanghai["university_name"].str.replace("Indiana University Bloomington","Indiana University", regex= True)
shanghai["university_name"] = shanghai["university_name"].str.replace("King Fahd University of Petroleum & Minerals", "King Fahd University of Petroleum and Minerals", regex= True)
shanghai["university_name"] = shanghai["university_name"].str.replace("MINES ParisTech", "Mines ParisTech", regex= True)
shanghai["university_name"] = shanghai["university_name"].str.replace("Polytechnic Institute of Milan", "Polytechnic University of Milan", regex= True)
shanghai["university_name"] = shanghai["university_name"].str.replace("Queen Mary, U. of London","Queen Mary, University of London", regex= True)
shanghai["university_name"] = shanghai["university_name"].str.replace("Royal Holloway, U. of London","Royal Holloway, University of London", regex= True)
shanghai["university_name"] = shanghai["university_name"].str.replace("Texas A & M University","Texas A&M University", regex= True)
shanghai["university_name"] = shanghai["university_name"].str.replace("Rutgers, The State University of New Jersey", "Rutgers, the State University of New Jersey", regex= True)
shanghai["university_name"] = shanghai["university_name"].str.replace("Swansea Univ", "Swansea University", regex= True)
shanghai["university_name"] = shanghai["university_name"].str.replace("Technical University Darmstadt", "Technical University of Darmstadt", regex= True)
shanghai["university_name"] = shanghai["university_name"].str.replace("Technion-Israel Institute of Technology", "Technion", regex= True)
shanghai["university_name"] = shanghai["university_name"].str.replace("Umea University", "Umeå University", regex= True)
shanghai["university_name"] = shanghai["university_name"].str.replace("University at Buffalo, the State University of New York", "University at Buffalo", regex= True)
shanghai["university_name"] = shanghai["university_name"].str.replace("University of Alaska", "University of Alaska Fairbanks", regex= True)
shanghai["university_name"] = shanghai["university_name"].str.replace("University of Colorado at Boulder", "University of Colorado Boulder", regex= True)
shanghai["university_name"] = shanghai["university_name"].str.replace("University of Goettingen", "University of Göttingen", regex= True)
shanghai["university_name"] = shanghai["university_name"].str.replace("University of Hawaii at Manoa", "University of Hawai’i at Mānoa", regex= True)
shanghai["university_name"] = shanghai["university_name"].str.replace("University of Jyvaskyla", "University of Jyväskylä", regex= True)
shanghai["university_name"] = shanghai["university_name"].str.replace("University of Lieg", "University of Liège", regex= True)
shanghai["university_name"] = shanghai["university_name"].str.replace("University of Massachusetts Amherst", "University of Massachusetts", regex= True)
shanghai["university_name"] = shanghai["university_name"].str.replace("University of Medicine and Dentistry New Jersey", "University of Medicine and Dentistry of New Jersey", regex= True)
shanghai["university_name"] = shanghai["university_name"].str.replace("University of Milan - Bicocca", "University of Milan-Bicocca", regex= True)
shanghai["university_name"] = shanghai["university_name"].str.replace("University of Minnesota, Twin Cities", "University of Minnesota", regex= True)
shanghai["university_name"] = shanghai["university_name"].str.replace("University of Michigan-Ann Arbor", "University of Michigan", regex= True)
shanghai["university_name"] = shanghai["university_name"].str.replace("University of Muenster", "University of Münster", regex= True)
shanghai["university_name"] = shanghai["university_name"].str.replace("University of Roma - Tor Vergata", "University of Roma-Tor Vergata", regex= True)
shanghai["university_name"] = shanghai["university_name"].str.replace("University of Santiago Compostela", "University of Santiago de Compostela", regex= True)
shanghai["university_name"] = shanghai["university_name"].str.replace("University of Sao Paulo", "University of São Paulo", regex= True)
shanghai["university_name"] = shanghai["university_name"].str.replace("University of Technology, Sydney", "University of Technology Sydney", regex= True)
shanghai["university_name"] = shanghai["university_name"].str.replace("University of Tuebingen", "University of Tübingen", regex= True)
shanghai["university_name"] = shanghai["university_name"].str.replace("University of Wisconsin - Milwaukee", "University of Wisconsin-Milwaukee", regex= True)
shanghai["university_name"] = shanghai["university_name"].str.replace("University of Wuerzburg", "University of Würzburg", regex= True)
shanghai["university_name"] = shanghai["university_name"].str.replace("Vrije Universiteit Brussel", "Vrije University Brussel", regex= True)
shanghai["university_name"] = shanghai["university_name"].str.replace("Xian Jiao Tong University", "Xi’an Jiaotong University", regex= True)
shanghai["university_name"] = shanghai["university_name"].str.replace("Ecole Normale Superieure - Lyon", "École normale supérieure de Lyon", regex= True)
shanghai["university_name"] = shanghai["university_name"].str.replace("Ecole Polytechnique", "École Polytechnique", regex= True)

Si elimina il nome della città o nome del campus dopo quello dell'università

In [45]:
shanghai["university_name"]=shanghai["university_name"].apply(lambda x: x.split(" - ")[0])
shanghai.university_name = shanghai.university_name.str.rstrip()

Sostituisco l'apostrofo

In [46]:
shanghai["university_name"] = shanghai["university_name"].str.replace("'","’", regex=True)

Si elimina il prefisso 'THE' e anche lo spazio rimanente

In [47]:
shanghai["university_name"] = shanghai["university_name"].str.replace("The","", regex=True)
shanghai.university_name = shanghai.university_name.str.lstrip()

Trasformo times["income"] da object a numeric per il punto 2

In [48]:
times["income"] = pd.to_numeric(times["income"], errors="coerce")

In [49]:
shanghai[["university_name"]].head()

                         university_name
0                     Harvard University
1                University of Cambridge
2                    Stanford University
3     University of California, Berkeley
4  Massachusetts Institute of Technology

In [50]:
times[["university_name"]].head()

                         university_name
0                     Harvard University
1     California Institute of Technology
2  Massachusetts Institute of Technology
3                    Stanford University
4                   Princeton University

Parte School

Cambio il nome per standardizzare la colonna

In [51]:
school.rename(columns={"school_name":"university_name"}, inplace=True)
school.head()

                         university_name                   country
0                     Harvard University  United States of America
1     California Institute of Technology  United States of America
2  Massachusetts Institute of Technology  United States of America
3                    Stanford University  United States of America
4                   Princeton University  United States of America

Faccio la merge tra shanghai e times per confrontarla con cwur e pulire eventuali dati

In [52]:
b = times["university_name"].unique()
b = sorted(b, key=str.lower)
print(b[:10])

['Aalborg University', 'Aalto University', 'Aarhus University', 'Aberystwyth University', 'Adam Mickiewicz University', 'AGH University of Science and Technology', 'Aix-Marseille University', 'Ajou University', 'Alexandria University', 'Alexandru Ioan Cuza University']

In [53]:
e = shanghai["university_name"].unique()
e = sorted(e, key=str.lower)
print(e[:10])

['Aalborg University', 'Aalto University', 'Aarhus University', 'Aix-Marseille University', 'Aristotle University of ssaloniki', 'Arizona State University', 'Auburn University', 'Australian National University', 'Autonomous University of Barcelona', 'Autonomous University of Madrid']

In [54]:
b = pd.DataFrame(b,columns=["university_name"])
e = pd.DataFrame(e,columns=["university_name"])

Salvo i dataframe in altre variabili per l'esercizio 10

In [55]:
unique_shanghai = e
unique_times = b

In [56]:
shanghaitimes = pd.merge(b,e)

Confronto quindi i valori unique dei due datasets in modo da trovare eventuali anomalie

In [57]:
shanghaitimes.head()

                     university_name
0                 Aalborg University
1                   Aalto University
2                  Aarhus University
3           Aix-Marseille University
4  Aristotle University of ssaloniki

In [58]:
len(shanghaitimes)

465

Parte Cwur

Isolo la colonna university_name

Controllo le differenze tra shanghaitimes e cwur nella colonna d'interesse

In [59]:
cwur_university_name = pd.DataFrame(c,columns=["university_name"])

In [60]:
cwur_university_name.head()

                        university_name
0                    Aalborg University
1                      Aalto University
2                     Aarhus University
3                Aberystwyth University
4  Adam Mickiewicz University in Poznań

In [61]:
right = shanghaitimes.merge(cwur_university_name, how = "outer" ,indicator=True).loc[lambda x : x["_merge"]=='right_only']
right.head()

                              university_name      _merge
465                    Aberystwyth University  right_only
466      Adam Mickiewicz University in Poznań  right_only
467  AGH University of Science and Technology  right_only
468                      Ain Shams University  right_only
469                           Ajou University  right_only

Uniformo il nome dei paesi

In [62]:
cwur["country"] = cwur["country"].str.replace("Slovak Republic", "Slovakia", regex= True)

Parte con cwur

In [63]:
cwur["institution"] = cwur["institution"].str.replace("Northeastern University (China)", "Northeastern University China", regex= True)

Si considera solo la parte di testo prima delle parentesi tonde

In [64]:
cwur["institution"]=cwur["institution"].apply(lambda x: x.split("(")[0])

Elimino lo spazio vicino alla parentesi

In [65]:
cwur.institution = cwur.institution.str.rstrip()

Sostituisco l'apostrofo

In [66]:
cwur["institution"] = cwur["institution"].str.replace("'","’", regex=True)

Si modificano manualmente le righe

In [67]:
cwur["institution"] = cwur["institution"].str.replace("London School of Economics", "London School of Economics and Political Science", regex= True)
cwur["institution"] = cwur["institution"].str.replace("National Sun Yat-sen University", "National Sun Yat-Sen University", regex= True)
cwur["institution"] = cwur["institution"].str.replace("Ohio State University, Columbus", "Ohio State University", regex= True)
cwur["institution"] = cwur["institution"].str.replace("Oklahoma State University–Stillwater", "Oklahoma State University", regex= True)
cwur["institution"] = cwur["institution"].str.replace("Oregon Health & Science University", "Oregon Health and Science University", regex= True)
cwur["institution"] = cwur["institution"].str.replace("Pennsylvania State University, University Park", "Pennsylvania State University", regex= True)
cwur["institution"] = cwur["institution"].str.replace("Technion – Israel Institute of Technology", "Technion", regex= True)
cwur["institution"] = cwur["institution"].str.replace("Texas A&M University, College Station", "Texas A&M University", regex= True)
cwur["institution"] = cwur["institution"].str.replace("Trinity College, Dublin", "Trinity College Dublin", regex= True)
cwur["institution"] = cwur["institution"].str.replace("University at Buffalo, the State University of New York", "University at Buffalo", regex= True)
cwur["institution"] = cwur["institution"].str.replace("University of Bari Aldo Moro", "University of Bari", regex= True)
cwur["institution"] = cwur["institution"].str.replace("University of Bordeaux I", "University of Bordeaux", regex= True)
cwur["institution"] = cwur["institution"].str.replace("University of Hawaii at Manoa", "University of Hawai’i at Mānoa", regex= True)
cwur["institution"] = cwur["institution"].str.replace("University of Illinois at Urbana–Champaign", "University of Illinois at Urbana-Champaign", regex= True)
cwur["institution"] = cwur["institution"].str.replace("University of Maryland, Baltimore", "University of Maryland, Baltimore County", regex= True)
#cambio il nome in quanto cercando University of Massachusetts Amherst viene fuori University of Massachusetts 
cwur["institution"] = cwur["institution"].str.replace("University of Massachusetts Amherst", "University of Massachusetts", regex= True)
cwur["institution"] = cwur["institution"].str.replace("University of Michigan, Ann Arbor", "University of Michigan", regex= True)
cwur["institution"] = cwur["institution"].str.replace("University of Milan - Bicocca", "University of Milan-Bicocca", regex= True)
cwur["institution"] = cwur["institution"].str.replace("University of Minnesota, Twin Cities", "University of Minnesota", regex= True)
cwur["institution"] = cwur["institution"].str.replace("University of Rome Tor Vergata", "University of Roma-Tor Vergata", regex= True)
cwur["institution"] = cwur["institution"].str.replace("Vrije Universiteit Brussel", "Vrije University Brussel", regex= True)
cwur["institution"] = cwur["institution"].str.replace("Washington State University, Pullman", "Washington State University", regex= True)
cwur["institution"] = cwur["institution"].str.replace("Xi'an Jiaotong University", "Xi’an Jiaotong University", regex= True)

Si elimina il nome della città o nome del campus dopo quello dell'università

In [68]:
cwur["institution"]=cwur["institution"].apply(lambda x: x.split(" - ")[0])
cwur.institution = cwur.institution.str.rstrip()

Si elimina il prefisso 'THE' e anche lo spazio rimanente

In [69]:
cwur["institution"] = cwur["institution"].str.replace("The","", regex=True)
cwur.institution = cwur.institution.str.lstrip()

Modifico per standardizzare il nome

In [70]:
cwur["country"]=cwur["country"].str.replace("USA","United States of America")

In [71]:
cwur.rename(columns={"institution":"university_name"}, inplace=True)
cwur.head()

,world_rank,university_name,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
0,1,Harvard University,United States of America,1,7,9,1,1,1,1,NaN,5,100.00,2012
1,2,Massachusetts Institute of Technology,United States of America,2,9,17,3,12,4,4,NaN,1,91.67,2012
2,3,Stanford University,United States of America,3,17,11,5,4,2,2,NaN,15,89.50,2012
3,4,University of Cambridge,United Kingdom,1,10,24,4,16,16,11,NaN,50,86.17,2012
4,5,California Institute of Technology,United States of America,4,2,29,7,37,22,22,NaN,18,85.21,2012

In [72]:
c = cwur["university_name"].unique()
c = sorted(c, key=str.lower)
print(c[:10])

['Aalborg University', 'Aalto University', 'Aarhus University', 'Aberystwyth University', 'Adam Mickiewicz University in Poznań', 'AGH University of Science and Technology', 'Ain Shams University', 'Aix-Marseille University', 'Ajou University', 'Albany Medical College']

Isolo la colonna d'interesse dopo la pulizia

In [73]:
cwurpulito = pd.DataFrame(c,columns=["university_name"])

In [74]:
cwurpulito.head()

                        university_name
0                    Aalborg University
1                      Aalto University
2                     Aarhus University
3                Aberystwyth University
4  Adam Mickiewicz University in Poznań

In [75]:
unique_cwur = cwurpulito

In [76]:
join3 = pd.merge(shanghaitimes,cwurpulito)
len(join3)

446

Parte educational

Correzione del nome dei paesi nella colonna country_name

In [77]:
educational["country_name"]=educational["country_name"].str.replace("Bahamas, The","Bahamas")
educational["country_name"]=educational["country_name"].str.replace("Egypt, Arab Rep","Egypt")
educational["country_name"]=educational["country_name"].str.replace("Gambia, The","Gambia")
educational["country_name"]=educational["country_name"].str.replace("Hong Kong SAR, China","Hong Kong")
educational["country_name"]=educational["country_name"].str.replace("Iran, Islamic Rep., The","Iran")
educational["country_name"]=educational["country_name"].str.replace("Lao PDR, The","Lao")
educational["country_name"]=educational["country_name"].str.replace("Macao SAR, China","Macao")
educational["country_name"]=educational["country_name"].str.replace("Macedonia, FYR","Macedonia")
educational["country_name"]=educational["country_name"].str.replace("Russian Federation","Russia")
educational["country_name"]=educational["country_name"].str.replace("Slovak Republic","Slovakia")
educational["country_name"]=educational["country_name"].str.replace("Syrian Arab Republic","Syria")
educational["country_name"]=educational["country_name"].str.replace("Venezuela, RB","Venezuela")
educational["country_name"]=educational["country_name"].str.replace("Yemen, Rep.","Yemen")

## 1. For each university, extract from the times dataset the most recent and the least recent data, obtaining two separate dataframes

Vado ad estrarre le righe con le università più recenti da times è necessario a questo scopo utilizzare loc

In [78]:
most_recent = times.loc[times.groupby("university_name")["year"].idxmax()]
most_recent.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,NaN,-,"35,569",17.0,1%,-,2016
2003,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,"17,422",15.9,15%,48 : 52,2016
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,"16,099",24.2,17%,32 : 68,2016
1908,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,"23,895",13.6,14%,54 : 46,2016
2105,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,"9,252",19.2,18%,48 : 52,2016

Vado ad estrarre le righe con le università meno recenti da times

In [79]:
least_recent = times.loc[times.groupby("university_name")["year"].idxmin()]
least_recent.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,NaN,-,"35,569",17.0,1%,-,2016
501,301-350,Aalborg University,Denmark,19.0,75.3,20.0,27.1,36.4,-,"17,422",15.9,15%,48 : 52,2012
502,301-350,Aalto University,Finland,26.2,49.0,22.2,37.5,61.9,-,"16,099",24.2,17%,32 : 68,2012
166,167,Aarhus University,Denmark,38.1,33.4,55.6,57.3,61.5,49.9,"23,895",13.6,14%,54 : 46,2011
476,276-300,Aberystwyth University,United Kingdom,19.8,63.8,15.5,56.6,35.5,-,"9,252",19.2,18%,48 : 52,2012

# 2. For each university, compute the improvement in income between the least recent and the most recent data points

Creo quindi un dataset unendo i valori vecchi e i valori recenti

In [80]:
improvement=pd.merge(least_recent[["university_name","income"]],most_recent[["university_name","income"]],on="university_name",suffixes=("_bef","_aft"))
improvement.head()

                            university_name  income_bef  income_aft
0  AGH University of Science and Technology         NaN         NaN
1                        Aalborg University        36.4        43.7
2                          Aalto University        61.9        61.6
3                         Aarhus University        61.5        68.3
4                    Aberystwyth University        35.5        31.3

Calcolo i valori della colonna richiesta sottraendo ai valori recenti quelli vecchi

In [81]:
improvement["income_delta"]=improvement["income_aft"]-improvement["income_bef"]
improvement.head()

,university_name,income_bef,income_aft,income_delta
0,AGH University of Science and Technology,NaN,NaN,NaN
1,Aalborg University,36.4,43.7,7.3
2,Aalto University,61.9,61.6,-0.3
3,Aarhus University,61.5,68.3,6.8
4,Aberystwyth University,35.5,31.3,-4.2

# 3. Find the university with the largest increase computed in the previous point

Trovo il massimo, ma la funzione fornisce in input il primo valore più grande e non eventuali righe con lo stesso valore di income_delta

In [82]:
improvement[improvement["income_delta"]>=improvement["income_delta"].max()]

    university_name  income_bef  income_aft  income_delta
429      TU Dresden        31.9        99.7          67.8

Verifico quindi che l'unica università con il valore massimo sia TU Dresden

In [83]:
improvement[improvement["income_delta"] >= 67.8]

    university_name  income_bef  income_aft  income_delta
429      TU Dresden        31.9        99.7          67.8

Si dimostra che il valore massimo di income_delta non era condiviso da altre università

Si evince quindi che l'università con l'incremento maggiore è "Technische Universität Dresden"

# 4. For each ranking, consider only the most recent data point. For each university, compute the maximum difference between the rankings (e.g. for Aarhus University the value is 122-73=49). Notice that some rankings are expressed as a range

Si utilizza un interrogazione come quella del punto 1

In [84]:
shanghai_max=shanghai.loc[shanghai.groupby("university_name")["year"].idxmax()]
shanghai_max.head()

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year
4697,301-400,Aalborg University,5,NaN,0.0,0.0,11.2,4.6,30.4,16.8,2015
4797,401-500,Aalto University,4-6,NaN,0.0,0.0,0.0,10.4,33.4,17.0,2015
4469,73,Aarhus University,2,27.3,11.5,22.1,12.3,25.8,51.8,31.0,2015
4497,101-150,Aix-Marseille University,5-6,NaN,13.6,0.0,15.2,20.3,50.1,27.6,2015
4798,401-500,Aristotle University of ssaloniki,2,NaN,0.0,0.0,4.9,1.5,34.0,16.8,2015

In [85]:
shanghai_max.shape

(640, 11)

In [86]:
f = shanghai_max["university_name"].unique()
f = sorted(f, key=str.lower)

In [87]:
len(f)

640

In [88]:
g = most_recent["university_name"].unique()
g = sorted(g, key=str.lower)

In [89]:
len(g)

818

In [90]:
cwur_max=cwur.loc[cwur.groupby("university_name")["year"].idxmax()]
cwur_max.head()

,world_rank,university_name,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
1981,782,AGH University of Science and Technology,Poland,4,267,279,218,708,891,511,896.0,398,44.26,2015
1764,565,Aalborg University,Denmark,5,367,439,218,596,660,287,520.0,401,44.59,2015
1620,421,Aalto University,Finland,4,367,224,218,336,403,645,424.0,246,45.10,2015
1321,122,Aarhus University,Denmark,2,310,165,106,91,81,101,95.0,154,49.65,2015
2013,814,Aberystwyth University,United Kingdom,59,367,567,218,842,552,511,754.0,607,44.22,2015

In [91]:
cwur_max.shape

(1021, 14)

In [92]:
h = cwur_max["university_name"].unique()
h = sorted(h, key=str.lower)
len(h)

1021

times

In [93]:
most_recent.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,NaN,-,"35,569",17.0,1%,-,2016
2003,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,"17,422",15.9,15%,48 : 52,2016
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,"16,099",24.2,17%,32 : 68,2016
1908,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,"23,895",13.6,14%,54 : 46,2016
2105,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,"9,252",19.2,18%,48 : 52,2016

In [94]:
most_recent.shape

(818, 14)

Facciamo la merge tra i vari datasets

In [95]:
shanghai_time = pd.merge(shanghai_max[["university_name","world_rank"]],most_recent[["university_name","world_rank"]],on="university_name",suffixes=("_shanghai",""))
shanghai_time.head()

                     university_name world_rank_shanghai world_rank
0                 Aalborg University             301-400    201-250
1                   Aalto University             401-500    251-300
2                  Aarhus University                  73       =106
3           Aix-Marseille University             101-150    251-300
4  Aristotle University of ssaloniki             401-500    601-800

In [96]:
shanghai_time.shape

(465, 3)

Vado a rinominare la colonna institution per uniformare

In [97]:
cwur_max.rename(columns={"institution":"university_name"}, inplace=True)
cwur_max.head()

,world_rank,university_name,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
1981,782,AGH University of Science and Technology,Poland,4,267,279,218,708,891,511,896.0,398,44.26,2015
1764,565,Aalborg University,Denmark,5,367,439,218,596,660,287,520.0,401,44.59,2015
1620,421,Aalto University,Finland,4,367,224,218,336,403,645,424.0,246,45.10,2015
1321,122,Aarhus University,Denmark,2,310,165,106,91,81,101,95.0,154,49.65,2015
2013,814,Aberystwyth University,United Kingdom,59,367,567,218,842,552,511,754.0,607,44.22,2015

In [98]:
ranks=pd.merge(shanghai_time,cwur_max[["university_name","world_rank"]],on="university_name",suffixes=("_times","_cwur"))
ranks.head()

,university_name,world_rank_shanghai,world_rank_times,world_rank_cwur
0,Aalborg University,301-400,201-250,565
1,Aalto University,401-500,251-300,421
2,Aarhus University,73,=106,122
3,Aix-Marseille University,101-150,251-300,206
4,Aristotle University of ssaloniki,401-500,601-800,459

In [99]:
ranks.shape

(446, 4)

Analizzo le colonne di riferimento

In [100]:
ranks["world_rank_cwur"].unique()

array([565, 421, 122, 206, 459,  97, 549, 179, 241, 304, 568, 521, 349,
       464, 698, 326,  66, 274,  83, 796,  12, 788, 201, 593,  61, 105,
       387, 402, 563, 270, 418, 627, 220, 628, 373, 207, 483, 271,   6,
       228, 417,  10, 595, 286, 305,  44, 579, 255, 258,  28, 261, 477,
       651, 348,  84, 390, 526, 583, 322, 620, 605, 252, 195, 414, 202,
       113,  80, 119, 670, 613, 634, 192, 410,   1,  23, 290, 178, 354,
       319, 719, 400, 448, 614, 106, 187, 623, 451, 541, 391,  16, 188,
       465, 457, 353, 213,  71,  34, 571, 995, 847, 569,  94, 320, 144,
       115, 419,  17, 401, 307, 100, 645, 426, 229, 264, 108, 279, 694,
       332, 117, 225, 449,   3, 658,  42, 150, 297, 303, 265, 611, 118,
       790, 104, 145, 556, 829, 486, 125, 244, 135, 334, 564, 226, 386,
       803,  57, 407,  65, 301, 761, 519,  18, 212, 468, 232, 275,  22,
       243,  49, 460, 245, 412, 656, 631, 166, 260, 474, 598,  45,  56,
        47, 165, 370, 397, 653, 440, 375, 661,   9, 452, 209, 621, 284,
       343, 230, 134, 282, 120, 540, 323, 364, 406, 361, 112,  24, 180,
       697, 479, 362, 615, 439, 142,   2, 306, 168, 138, 277, 211, 729,
       416, 688, 463, 345, 174, 136,  86, 381, 102, 469, 331, 689,  73,
       109, 392, 501, 624, 481, 420, 185,  78,  95, 272, 287, 436, 238,
        27, 285, 335, 591, 107, 114, 312,  68, 266, 116, 377, 160, 405,
       726, 283, 200, 152, 208, 158, 299, 821, 535, 123,  62, 570, 891,
       167,   7,  53,  89,  15, 214,  21,  64, 154,   4, 533, 248,   8,
       425, 157, 507,  54, 218,  74, 281, 288, 242, 336, 366,  55, 204,
       632, 333, 369, 247,  60, 573,  92, 330, 198, 128, 237, 431, 584,
       785, 110, 368, 177, 700, 162, 488, 111, 604, 170, 184, 655, 203,
        33, 347, 141, 671, 196, 267, 215, 490, 478, 186, 161, 240, 257,
       199, 504,  67, 222, 175,  72, 219,  93, 137,  19, 172, 382,  48,
       585, 151, 205, 268, 399, 181, 130, 494, 505,  40,  77, 140, 350,
       339,  99, 357, 193, 447,   5, 169, 528, 456, 327,  14, 295,  46,
       308, 678, 103, 263, 475,  81, 317, 363, 455, 239, 398, 173, 446,
       300, 190, 148,  51, 356, 309, 182, 453, 316, 525, 253,  88, 731,
       132, 523, 768,  30, 139, 291,  13,  32, 342, 262, 221, 383, 408,
       156,  70, 294, 324, 352, 223, 686,  41, 462, 293,  31, 269, 216,
       467, 466, 325, 484,  96, 485, 149, 124,  87, 129,  69, 588, 427,
       256, 280, 159,  38, 380,  52, 189, 415, 313, 389,  11, 171,  98,
       337, 191,  36, 471], dtype=int64)

In [101]:
ranks["world_rank_cwur"].describe()

count    446.000000
mean     305.522422
std      206.374870
min        1.000000
25%      137.250000
50%      276.000000
75%      448.750000
max      995.000000
Name: world_rank_cwur, dtype: float64

In [102]:
rs = ranks["world_rank_shanghai"].unique()
rs

array(['301-400', '401-500', '73', '101-150', '93', '77', '201-300',
       '403-510', '75', '7', '151-200', '61', '8', '13', '31', '402-501',
       '71', '1', '67', '16', '48', '55', '26', '82', '3', '64', '96',
       '99', '402-503', '27', '85', '60', '6', '84', '2', '100', '18',
       '90', '87', '97', '66', '40', '4', '57', '50', '12', '14', '38',
       '5', '9', '34', '35', '47', '83', '58', '29', '41', '43', '44',
       '22', '30', '39', '10', '17', '49', '37', '21', '25', '92', '15',
       '54', '56', '98', '53', '32', '11'], dtype=object)

In [103]:
ranks["world_rank_times"].unique()

array(['201-250', '251-300', '=106', '601-800', '189', '501-600', '52',
       '146', '301-350', '401-500', '=190', '64', '=185', '51', '1',
       '=182', '22', '=133', '=138', '15', '18', '=104', '=65', '351-400',
       '20', '70', '=176', '=90', '=94', '41', '118', '6', '178', '59',
       '11', '28', '27', '148', '=88', '130', '67', '23', '5', '38',
       '=99', '350-400', '226-250', '73', '55', '=167', '26', '30',
       '=196', '25', '42', '75', '116', '=164', '7', '98', '200', '=110',
       '=125', '=101', '129', '85', '3', '136', '153', '=193', '160',
       '=47', '=127', '14', '=172', '=149', '137', '58', '163', '174',
       '=120', '119', '69', '34', '13', '=44', '16', '=39', '=144', '4',
       '10', '=82', '24', '=123', '93', '=131', '=76', '=180', '74', '36',
       '175', '157', '=56', '117', '141', '33', '=161', '21', '=113',
       '63', '108', '143', '135', '2', '17', '79', '=60', '=158', '97',
       '68', '86', '140', '46', '43', '19', '78', '142', '147', '80',
       '32', '179', '109', '81', '62', '154', '87', '12'], dtype=object)

Decido quindi di eliminare "=" world_rank_times in quanto inutile e difforme rispetto ai valori delle altre colonne

In [104]:
ranks["world_rank_times"]=ranks["world_rank_times"].str.replace("\=", "", regex=True)

Creo delle colonne dummy per avere il minimo e il massimo del range in colonne separate

In [105]:
ranks["rangemintime"]=ranks["world_rank_times"].str.replace("(\d+)-(\d+)", r"\1", regex=True)
ranks["rangemaxtime"]=ranks["world_rank_times"].str.replace("(\d+)-(\d+)", r"\2", regex=True)

In [106]:
ranks["rangeminshanghai"]=ranks["world_rank_shanghai"].str.replace("(\d+)-(\d+)", r"\1", regex=True)
ranks["rangemaxshanghai"]=ranks["world_rank_shanghai"].str.replace("(\d+)-(\d+)", r"\2", regex=True)

In [107]:
ranks.head()

,university_name,world_rank_shanghai,world_rank_times,world_rank_cwur,rangemintime,rangemaxtime,rangeminshanghai,rangemaxshanghai
0,Aalborg University,301-400,201-250,565,201,250,301,400
1,Aalto University,401-500,251-300,421,251,300,401,500
2,Aarhus University,73,106,122,106,106,73,73
3,Aix-Marseille University,101-150,251-300,206,251,300,101,150
4,Aristotle University of ssaloniki,401-500,601-800,459,601,800,401,500

Trasformo le colonne in numeriche in modo da poter fare la media

In [108]:
ranks[["rangemintime", "rangemaxtime","rangeminshanghai","rangemaxshanghai"]] = ranks[["rangemintime", "rangemaxtime","rangeminshanghai","rangemaxshanghai"]].apply(pd.to_numeric)

In [109]:
ranks["world_rank_times"] = ranks[["rangemintime", "rangemaxtime"]].mean(axis=1)

In [110]:
ranks["world_rank_shanghai"] = ranks[["rangeminshanghai", "rangemaxshanghai"]].mean(axis=1)

Elimino le colonne di troppo

In [111]:
ranks.drop(["rangemintime", "rangemaxtime","rangeminshanghai","rangemaxshanghai"], axis=1, inplace=True)

In [112]:
ranks.head()

,university_name,world_rank_shanghai,world_rank_times,world_rank_cwur
0,Aalborg University,350.5,225.5,565
1,Aalto University,450.5,275.5,421
2,Aarhus University,73.0,106.0,122
3,Aix-Marseille University,125.5,275.5,206
4,Aristotle University of ssaloniki,450.5,700.5,459

Calcolo la differenza tra il valore maggiore e quello minore dei rankings

In [113]:
ranks["max_diff_rank"]=ranks.max(axis=1)-ranks.min(axis=1)

In [114]:
ranks.head()

,university_name,world_rank_shanghai,world_rank_times,world_rank_cwur,max_diff_rank
0,Aalborg University,350.5,225.5,565,339.5
1,Aalto University,450.5,275.5,421,175.0
2,Aarhus University,73.0,106.0,122,49.0
3,Aix-Marseille University,125.5,275.5,206,150.0
4,Aristotle University of ssaloniki,450.5,700.5,459,250.0

Verifico che Aarhus University abbia realmente il max_diff_rank di 49

In [115]:
ranks.iloc[[2]]

,university_name,world_rank_shanghai,world_rank_times,world_rank_cwur,max_diff_rank
2,Aarhus University,73.0,106.0,122,49.0

La differenza maggiore si ha con King Abdulaziz University

In [116]:
ranks[ranks["max_diff_rank"]>=ranks["max_diff_rank"].max()]

,university_name,world_rank_shanghai,world_rank_times,world_rank_cwur,max_diff_rank
98,King Abdulaziz University,175.5,275.5,995,819.5

In [117]:
ranks[ranks["max_diff_rank"] >= 819.5]

,university_name,world_rank_shanghai,world_rank_times,world_rank_cwur,max_diff_rank
98,King Abdulaziz University,175.5,275.5,995,819.5

# 5)Consider only the most recent data point of the times dataset. Compute the number of male and female students for each country

Prendo in considerazione solo le righe più recenti di times estratte prima

In [118]:
most_recent.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,NaN,-,"35,569",17.0,1%,-,2016
2003,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,"17,422",15.9,15%,48 : 52,2016
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,"16,099",24.2,17%,32 : 68,2016
1908,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,"23,895",13.6,14%,54 : 46,2016
2105,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,"9,252",19.2,18%,48 : 52,2016

Devo quindi considerare la colonna num_students e female_male_ratio

Osservo la colonna num_students

In [119]:
pd.set_option("max_rows", None)

Guardo i valori della colonna per farmi un'idea del contenuto

In [120]:
most_recent[["num_students"]].head()

     num_students
2405       35,569
2003       17,422
2056       16,099
1908       23,895
2105        9,252

Elimino la virgola dai valori per non avere difformità e problemi con i valori dopo averli trasformati in float

In [121]:
most_recent.dtypes

world_rank                 object
university_name            object
country                    object
teaching                  float64
international              object
research                  float64
citations                 float64
income                    float64
total_score                object
num_students               object
student_staff_ratio       float64
international_students     object
female_male_ratio          object
year                        int64
dtype: object

In [122]:
most_recent["num_students"]=most_recent["num_students"].str.replace('\,', '', regex=True)

Verifico la colonna

In [123]:
most_recent[["num_students"]].head()

     num_students
2405        35569
2003        17422
2056        16099
1908        23895
2105         9252

Trasformo in float i valori della colonna

In [124]:
most_recent["num_students"]=pd.to_numeric(most_recent["num_students"],errors="coerce")

In [125]:
most_recent.dropna(subset=["num_students"],inplace=True)

Osservo l'altra colonna d'interesse

In [126]:
most_recent[["female_male_ratio"]].head()

     female_male_ratio
2405                 -
2003           48 : 52
2056           32 : 68
1908           54 : 46
2105           48 : 52

Elimino i valori nulli delle due colonne

In [127]:
most_recent.dropna(subset=["num_students"],inplace=True)

In [128]:
most_recent[["num_students"]].head()

      num_students
2405       35569.0
2003       17422.0
2056       16099.0
1908       23895.0
2105        9252.0

In [129]:
most_recent.dropna(subset=["female_male_ratio"],inplace=True)

Vedo che dropna lascia comunque dei valori nulli quindi decido di usare un altro comando

In [130]:
most_recent[["female_male_ratio"]].head()

     female_male_ratio
2405                 -
2003           48 : 52
2056           32 : 68
1908           54 : 46
2105           48 : 52

In [131]:
most_recent=most_recent[most_recent.female_male_ratio.str.contains(":")]

In [132]:
most_recent.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
2003,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,17422.0,15.9,15%,48 : 52,2016
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,16099.0,24.2,17%,32 : 68,2016
1908,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,23895.0,13.6,14%,54 : 46,2016
2105,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,9252.0,19.2,18%,48 : 52,2016
2404,601-800,Adam Mickiewicz University,Poland,20.0,25.7,11.0,15.3,28.7,-,40633.0,15.6,1%,71 : 29,2016

Isolo la parte prima dei :

In [133]:
most_recent["female_ratio"]=most_recent["female_male_ratio"].apply(lambda x: x.split(":")[0])

Isolo la parte dopo i :

In [134]:
most_recent["male_ratio"]=most_recent["female_male_ratio"].apply(lambda x: x.split(":")[1])

In [135]:
most_recent.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,female_ratio,male_ratio
2003,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,17422.0,15.9,15%,48 : 52,2016,48,52
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,16099.0,24.2,17%,32 : 68,2016,32,68
1908,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,23895.0,13.6,14%,54 : 46,2016,54,46
2105,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,9252.0,19.2,18%,48 : 52,2016,48,52
2404,601-800,Adam Mickiewicz University,Poland,20.0,25.7,11.0,15.3,28.7,-,40633.0,15.6,1%,71 : 29,2016,71,29

Trasformo female_ratio e male_ratio in float per poterli dividere e moltiplicare

In [136]:
most_recent["female_ratio"]=pd.to_numeric(most_recent["female_ratio"],errors="coerce")
most_recent["male_ratio"]=pd.to_numeric(most_recent["male_ratio"],errors="coerce")

In [137]:
most_recent["female"]=(most_recent["female_ratio"]/100)*most_recent["num_students"]
most_recent["male"]=(most_recent["male_ratio"]/100)*most_recent["num_students"]

In [138]:
most_recent.groupby("country",as_index=False)["female"].sum().round().head()

      country    female
0   Argentina   67191.0
1   Australia  391736.0
2     Austria   68364.0
3  Bangladesh   21323.0
4     Belarus   20219.0

In [139]:
most_recent.groupby("country",as_index=False)["male"].sum().round().head()

      country      male
0   Argentina   41182.0
1   Australia  321640.0
2     Austria   66113.0
3  Bangladesh   41393.0
4     Belarus    9084.0

# 6. Find the universities where the ratio between female and male is below the average ratio (computed over all universities)

Prendo il dataset di riferimento

In [140]:
most_recent.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,female_ratio,male_ratio,female,male
2003,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,17422.0,15.9,15%,48 : 52,2016,48,52,8362.56,9059.44
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,16099.0,24.2,17%,32 : 68,2016,32,68,5151.68,10947.32
1908,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,23895.0,13.6,14%,54 : 46,2016,54,46,12903.30,10991.70
2105,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,9252.0,19.2,18%,48 : 52,2016,48,52,4440.96,4811.04
2404,601-800,Adam Mickiewicz University,Poland,20.0,25.7,11.0,15.3,28.7,-,40633.0,15.6,1%,71 : 29,2016,71,29,28849.43,11783.57

In [141]:
most_recent["ratiobetween_MF"] = most_recent["female"]/most_recent["male"]

In [142]:
most_recent.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,female_ratio,male_ratio,female,male,ratiobetween_MF
2003,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,17422.0,15.9,15%,48 : 52,2016,48,52,8362.56,9059.44,0.923077
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,16099.0,24.2,17%,32 : 68,2016,32,68,5151.68,10947.32,0.470588
1908,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,23895.0,13.6,14%,54 : 46,2016,54,46,12903.30,10991.70,1.173913
2105,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,9252.0,19.2,18%,48 : 52,2016,48,52,4440.96,4811.04,0.923077
2404,601-800,Adam Mickiewicz University,Poland,20.0,25.7,11.0,15.3,28.7,-,40633.0,15.6,1%,71 : 29,2016,71,29,28849.43,11783.57,2.448276

In [143]:
mean = most_recent["ratiobetween_MF"].mean()

Guardo i valori singolarmente

In [144]:
#most_recent["ratiobetween_MF"]

Scopro il valore inf che vado a sostituire con 100 in quanto l'università è femminile

In [145]:
most_recent.at[2227, "ratiobetween_MF"] = 100

In [146]:
most_recent["ratiobetween_MF"].mean()

1.2149571636836496

Trovo quindi le università il cui rapporto sotto la media

In [147]:
universitybelowmean = most_recent[most_recent["ratiobetween_MF"] < most_recent["ratiobetween_MF"].mean()]
universitybelowmean.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,female_ratio,male_ratio,female,male,ratiobetween_MF
2003,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,17422.0,15.9,15%,48 : 52,2016,48,52,8362.56,9059.44,0.923077
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,16099.0,24.2,17%,32 : 68,2016,32,68,5151.68,10947.32,0.470588
1908,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,23895.0,13.6,14%,54 : 46,2016,54,46,12903.30,10991.70,1.173913
2105,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,9252.0,19.2,18%,48 : 52,2016,48,52,4440.96,4811.04,0.923077
2406,601-800,Ajou University,South Korea,19.5,20.0,11.9,23.9,45.7,-,12706.0,11.3,2%,33 : 67,2016,33,67,4192.98,8513.02,0.492537

# 7. For each country, compute the fraction of the students in the country that are in one of the universities computed in the previous point (that is, the denominator of the ratio is the total number of students over all universities in the country).

Faccio il raggruppamento della somma degli studenti appartenti ad un'università "sotto la media" per paese

In [148]:
student_university_below_country=universitybelowmean.groupby("country",as_index=False)["num_students"].sum()
student_university_below_country.head()

      country  num_students
0   Australia      295021.0
1     Austria       79242.0
2  Bangladesh       62716.0
3     Belgium      116129.0
4      Brazil      438476.0

Raggruppo il numero di studenti per stato

In [149]:
students_university = most_recent.groupby("country",as_index=False)["num_students"].sum()
students_university.head()

      country  num_students
0   Argentina      108373.0
1   Australia      713376.0
2     Austria      134477.0
3  Bangladesh       62716.0
4     Belarus       29303.0

Vado ad unire le due colonne in una tabella unica attraverso country

In [150]:
fuso = pd.merge(student_university_below_country, students_university, on = "country", suffixes=("_subc", '_su'))
fuso.head()

      country  num_students_subc  num_students_su
0   Australia           295021.0         713376.0
1     Austria            79242.0         134477.0
2  Bangladesh            62716.0          62716.0
3     Belgium           116129.0         169661.0
4      Brazil           438476.0         494251.0

In [151]:
fuso["ratio"]=fuso["num_students_subc"]/fuso["num_students_su"]
fuso.head()

      country  num_students_subc  num_students_su     ratio
0   Australia           295021.0         713376.0  0.413556
1     Austria            79242.0         134477.0  0.589261
2  Bangladesh            62716.0          62716.0  1.000000
3     Belgium           116129.0         169661.0  0.684477
4      Brazil           438476.0         494251.0  0.887152

# 8. Read the file educational_attainment_supplementary_data.csv, discarding any row with missing country_name or series_name

In [152]:
educational[["country_name","series_name"]].head()

  country_name                                        series_name
0  Afghanistan  Barro-Lee: Average years of primary schooling,...
1  Afghanistan  Barro-Lee: Average years of primary schooling,...
2  Afghanistan  Barro-Lee: Average years of primary schooling,...
3  Afghanistan  Barro-Lee: Average years of primary schooling,...
4  Afghanistan  Barro-Lee: Average years of primary schooling,...

Le uniche righe con NaN solo le ultime 2 applico un comando per eliminarle

In [153]:
educational[["country_name","series_name"]].tail()

,country_name,series_name
79047,Zimbabwe,UIS: Percentage of population age 25+ with unk...
79048,Zimbabwe,UIS: Percentage of population age 25+ with unk...
79049,Zimbabwe,UIS: Percentage of population age 25+ with unk...
79053,Data from database: Education Statistics: Educ...,NaN
79054,Last Updated: 10/20/2015,NaN

In [154]:
educational[["country_name","series_name"]].shape

(79052, 2)

In [155]:
edu = educational.dropna(subset=["country_name", "series_name"])
edu.shape

(79050, 29)

In [156]:
edu[["country_name","series_name"]].tail()

      country_name                                        series_name
79045     Zimbabwe  UIS: Percentage of population age 25+ with som...
79046     Zimbabwe  UIS: Percentage of population age 25+ with som...
79047     Zimbabwe  UIS: Percentage of population age 25+ with unk...
79048     Zimbabwe  UIS: Percentage of population age 25+ with unk...
79049     Zimbabwe  UIS: Percentage of population age 25+ with unk...

# 9. From attainment build a dataframe with the same data, but with 4 columns: country_name, series_name, year, value

In [157]:
new_edu = pd.melt(edu, id_vars=["country_name", "series_name"], var_name = "year", value_name = "value")
new_edu.head()

  country_name                                        series_name  year  value
0  Afghanistan  Barro-Lee: Average years of primary schooling,...  1985   0.33
1  Afghanistan  Barro-Lee: Average years of primary schooling,...  1985   1.03
2  Afghanistan  Barro-Lee: Average years of primary schooling,...  1985   0.83
3  Afghanistan  Barro-Lee: Average years of primary schooling,...  1985   2.34
4  Afghanistan  Barro-Lee: Average years of primary schooling,...  1985   0.54

# 10. For each university, find the number of rankings in which they appear (it suffices to appear in one year for each ranking).

Considero quindi i datasets times, cwur e shanghai

Prendo i considerazione solo i valori unique di ogni datasets estrapolati precedentemente

Metto insieme le varie università al fine di contare le ricorrenze

In [158]:
overall=pd.concat([unique_times,unique_shanghai,unique_cwur])
overall.head()

              university_name
0          Aalborg University
1            Aalto University
2           Aarhus University
3      Aberystwyth University
4  Adam Mickiewicz University

Svolgo il conteggio delle ricorrenze per ogni università

In [159]:
overall.groupby("university_name")["university_name"].count().reset_index(name="conteggio").head()

                            university_name  conteggio
0  AGH University of Science and Technology          2
1                        Aalborg University          3
2                          Aalto University          3
3                         Aarhus University          3
4                    Aberystwyth University          2

# 11)In the times ranking, compute the number of times each university appears

Vado a raggruppare per il numero delle università per ottenere il conteggio

In [160]:
numberoftimes = times.groupby("university_name", as_index = False)["world_rank"].count()
numberoftimes.head()

                            university_name  world_rank
0  AGH University of Science and Technology           1
1                        Aalborg University           5
2                          Aalto University           5
3                         Aarhus University           6
4                    Aberystwyth University           5

# 12)Find the universities that appear at most twice in the times ranking.

In [161]:
numberoftimes[numberoftimes["world_rank"] <= 2].head()

                            university_name  world_rank
0  AGH University of Science and Technology           1
5                Adam Mickiewicz University           1
6                  Aix-Marseille University           1
7                           Ajou University           1
9            Alexandru Ioan Cuza University           1

# 13)The universities that, in any year, have the same position in all three rankings (they must have the same position in a year).

A questo proposito vado a fare la merge tra i vari datasets

In [162]:
shanghai_times=pd.merge(shanghai[["university_name", "year","world_rank"]], times[["university_name", "year","world_rank"]], on= ["university_name","year"])

In [163]:
shanghai_times_cwur=pd.merge(shanghai_times, cwur[["university_name","year","world_rank"]], on=["university_name", "year"])
shanghai_times_cwur.head()

,university_name,year,world_rank_x,world_rank_y,world_rank
0,Harvard University,2012,1,2,1
1,Stanford University,2012,2,2,3
2,Massachusetts Institute of Technology,2012,3,7,2
3,"University of California, Berkeley",2012,4,10,10
4,University of Cambridge,2012,5,6,4

Cambio il nome delle colonne per renderne immediata la comprensione

In [164]:
shanghai_times_cwur.rename(columns={"world_rank_x":"shanghai_rank", "world_rank_y":"times_rank", "world_rank":"cwur_rank"},inplace=True)

In [165]:
shanghai_times_cwur.head()

,university_name,year,shanghai_rank,times_rank,cwur_rank
0,Harvard University,2012,1,2,1
1,Stanford University,2012,2,2,3
2,Massachusetts Institute of Technology,2012,3,7,2
3,"University of California, Berkeley",2012,4,10,10
4,University of Cambridge,2012,5,6,4

Elimino = dalla colonna

In [166]:
shanghai_times_cwur["times_rank"]=shanghai_times_cwur["times_rank"].str.replace("\=", "", regex=True)

Trasformo i valori times_rank cwur_rank shanghai_rank in numerici per poter effettuare la ricerca

In [167]:
shanghai_times_cwur["times_rank"]=pd.to_numeric(shanghai_times_cwur["times_rank"],errors="coerce")
shanghai_times_cwur["cwur_rank"]=pd.to_numeric(shanghai_times_cwur["cwur_rank"],errors="coerce", downcast="float")
shanghai_times_cwur["shanghai_rank"]=pd.to_numeric(shanghai_times_cwur["shanghai_rank"],errors="coerce")

In [168]:
same_rank=shanghai_times_cwur[(shanghai_times_cwur["shanghai_rank"] == shanghai_times_cwur["times_rank"])&(shanghai_times_cwur["cwur_rank"] == shanghai_times_cwur["times_rank"])]
same_rank

        university_name  year  shanghai_rank  times_rank  cwur_rank
80  Stanford University  2013            2.0         2.0        2.0